# Selecting Data - Lab

## Introduction 

NASA wants to go to Mars! Before they build their rocket, NASA needs to track information about all of the planets in the Solar System. In this lab, you'll practice querying the database with various SELECT statements. This will include selecting different columns, and employ other SQL clauses like WHERE to return the data desired.

![solar_system](https://bilingualcarloscano.files.wordpress.com/2010/05/venus.jpg)

## Objectives
You will be able to:
* Retrieve all the information from a table
* Retrieve a subset of records from a table using a `WHERE` clause
* Retrieve a subset of columns from a table

## Connecting to the DataBase

To get started, connect to the database titled `planets.db`. Don't forget to also make a cursor so that you can later execute your queries.

In [8]:
#Your code here
import pandas as p
import sqlite3
conn = sqlite3.connect('planets.db')
c = conn.cursor()

## Selecting Data

Here's an overview of the planet's table you'll be querying.

|name   |color |num_of_moons|mass|rings|
|-------|-------|-------|-------|-------|
|Mercury|gray   |0      |0.55   |no     |
|Venus  |yellow |0      |0.82   |no     |
|Earth  |blue   |1      |1.00   |no     |
|Mars   |red    |2      |0.11   |no     |
|Jupiter|orange |67     |317.90 |no     |
|Saturn |hazel  |62     |95.19  |yes    |
|Uranus |light blue|27  |14.54  |yes    |
|Neptune|dark blue|14   |17.15  |yes    |

Write SQL queries for each of the statements below.

## Select just the name and color of each planet

In [16]:
#Your code here
c.execute("""select name, color from planets;""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

      name       color
0  Mercury        gray
1    Venus      yellow
2    Earth        blue
3     Mars         red
4  Jupiter      orange
5   Saturn       hazel
6   Uranus  light blue
7  Neptune   dark blue

## Select all columns for each planet whose mass is greater than 1.00

In [18]:
#Your code here
c.execute("""select * from planets where mass > 1;""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

   id     name       color  num_of_moons    mass  rings
0   5  Jupiter      orange            68  317.90      0
1   6   Saturn       hazel            62   95.19      1
2   7   Uranus  light blue            27   14.54      1
3   8  Neptune   dark blue            14   17.15      1

## Select the name and mass of each planet whose mass is less than or equal to 1.00

In [22]:
#Your code here
c.execute("""select name, mass from planets where mass <= 1;""")
df= pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

      name  mass
0  Mercury  0.55
1    Venus  0.82
2    Earth  1.00
3     Mars  0.11

## Select the name and color of each planet that has more than 10 moons

In [25]:
#Your code here
c.execute("""select name, color from planets where num_of_moons >= 10;""")
df= pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

      name       color
0  Jupiter      orange
1   Saturn       hazel
2   Uranus  light blue
3  Neptune   dark blue

## Select the planet that has at least one moon and a mass less than 1.00

In [28]:
#Your code here
c.execute("""select name, mass from planets where num_of_moons >=1 and mass < 1;""")
df= pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

   name  mass
0  Mars  0.11

## Select the name and color of planets that have a color of blue, light blue, or dark blue

In [33]:
#Your code here
c.execute("""select name, 
            color 
            from planets 
            where color = blue
            or color = light blue
            or color = dark blue;
            """
             )
df= pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

OperationalError: near "blue": syntax error

## Summary

Congratulations! NASA is one step closer to embarking upon its mission to Mars. In this lab, You practiced writing select statements that query a single table to get specific information. You also used other clauses and specified column names to cherry pick the data we wanted to retrieve.